'''1.Написати лямбда функцію яка приймає один або 2 аргументи (другому задати значення за замовчуванням рівне 100,
як у звичайних функціях) та друкує символ переданий як перший аргумент ту кількість раз яка вказана в другому аргументі,
 зробити можливим роботу фнкції не тільки з рядком а й з цифрами.'''

my_lambda = lambda char, repeat=5: print(char * repeat)
my_lambda(5, 2)
my_lambda(5, 5)
'''2.Написати лямбда функцію яка приймає 2 числа як аргументи та повертає більше з них (використовуйте тернарний if) '''
find_m = lambda x, y: x if x > y else y
print(find_m(11, 4))
print(find_m(5, 8))
'''3. Написати лямбда функція яка нічого не приймає та завжди повертає 10.'''
return_10 = lambda: 10
result = return_10()
print(f'Results: {result}')
''' 4.1. Використовуйте list comprehension, щоб створити новий список, але додайте 6 до кожного елемента. '''
lst1 = [44, 54, 64, 74, 104]

lst2 = [item +6 for item in lst1] # місце для відповіді
print(lst2)

''' 4.2. Дано словник який складається з транспортних засобів та їх маси в кілограмах. 
Складіть список назв транспортних засобів вагою до 5000 кілограмів. 
У тому самому list comprehension зробіть імена ключів великими регістром. '''

car_dict = {"Sedan": 1500, "SUV": 2000, "Pickup": 2500, "Minivan": 1600, "Van": 2400, "Semi": 13600, "Bicycle": 7,
         "Motorcycle": 110}

list5 = [key.upper() for key in car_dict if car_dict[key] <=5000] # місце для відповіді

print(list5)


''' 4.3.Написати функцію яка повертає назву місяця за його номером. 
Використовуючи функцію map() і список який складається з чисел вивести список з навзвами місяців '''

m_names = {
    1: "Січень",
    2: "Лютий",
    3: "Березень",
    4: "Квітень",
    5: "Травень",
    6: "Червень",
    7: "Липень",
    8: "Серпень",
    9: "Вересень",
    10: "Жовтень",
    11: "Листопад",
    12: "Грудень"
}

def get_m_names(numbers):
    return m_names[numbers]
print(get_m_names(1))
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
m_names = list(map(get_m_names,numbers))
print(m_names)


