# Lambda
# Написати лямбда функцію яка приймає один або 2 аргументи (другому задати значення за замовчуванням рівне 100, як у
# звичайних функціях) та друкує символ переданий як перший аргумент ту кількість раз яка вказана в другому аргументі,
# зробити можливим роботу функції не тільки з рядком а й з цифрами.
count_symbol = lambda symbol, count=100: print(str(symbol) * count)

count_symbol('sta_', 3)
count_symbol(2)

# Написати лямбда функцію яка приймає 2 числа як аргументи та повертає більше з них (використовуйте тернарний if)
bigger_number = lambda num_1, num_2: (num_1 if num_1 >= num_2 else num_2)

print(bigger_number(2, 3))

# Написати лямбда функція яка нічого не приймає та завжди повертає 10.
return_10 = lambda _=None: 10

result = return_10()

print(result)

# List comprehension
# Використовуйте list comprehension, щоб створити новий список, але додайте 6 до кожного елемента.
lst1 = [44, 54, 64, 74, 104]

lst2 = [x + 6 for x in lst1]

print(lst2)

# Використовуючи list comprehension, побудуйте список із квадратів кожного елемента в списку.

lst3 = [2, 4, 6, 8, 10, 12, 14]

list4 = [i ** 2 for i in lst3]

print(list4)

# Дано словник який складається з транспортних засобів та їх маси в кілограмах.
# Складіть список назв транспортних засобів вагою до 5000 кілограмів.
# У тому самому list comprehension зробіть імена ключів великими регістром.

car_dict = {"Sedan": 1500, "SUV": 2000, "Pickup": 2500, "Minivan": 1600, "Van": 2400, "Semi": 13600, "Bicycle": 7, "Motorcycle": 110}

list5 = [wheels.upper() for wheels, weight in car_dict.items() if weight <= 5000]

print(list5)

# Map
# Написати функцію яка повертає назву місяця за його номером.
# Використовуючи функцію map() і список який складається з чисел вивести список з навзвами місяців.

def get_month_name(month_number):
    months = [
        "Січень", "Лютий", "Березень", "Квітень", "Травень", "Червень",
        "Липень", "Серпень", "Вересень", "Жовтень", "Листопад", "Грудень"
    ]
    return months[month_number - 1]

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

month_names = list(map(get_month_name, numbers))

print(month_names)

