import calendar

# Lambda

# 1. Написати лямбда функцію яка приймає один або 2 аргументи (другому задати значення за замовчуванням рівне 100,
# як у звичайних функціях) та друкує символ переданий як перший аргумент ту кількість раз яка вказана в другому
# аргументі, зробити можливим роботу фнкції не тільки з рядком а й з цифрами.
var_lambda1 = lambda x, y = 100: str(x) * y

# 2. Написати лямбда функцію яка приймає 2 числа як аргументи та повертає більше з них (використовуйте тернарний if)
var_lambda2 = lambda x, y: x if x >= y else y

# 3. Написати лямбда функція яка нічого не приймає та завжди повертає 10.
var_lambda3 = lambda: 10

# List comprehension

# 1. Використовуйте list comprehension, щоб створити новий список, але додайте 6 до кожного елемента.
lst1 = [44, 54, 64, 74, 104]

lst2 = [x + 6 for x in lst1]

print(lst2)

# 2. Використовуючи list comprehension, побудуйте список із квадратів кожного елемента в списку.
lst3 = [2, 4, 6, 8, 10, 12, 14]

list4 = [x ** 2 for x in lst3]

print(list4)

# 3. Дано словник який складається з транспортних засобів та їх маси в кілограмах. Складіть список назв
# транспортних засобів вагою до 5000 кілограмів. У тому самому list comprehension зробіть імена ключів
# великими регістром.
car_dict = {
    "Sedan": 1500,
    "SUV": 2000,
    "Pickup": 2500,
    "Minivan": 1600,
    "Van": 2400,
    "Semi": 13600,
    "Bicycle": 7,
    "Motorcycle": 110
}

list5 = [m.upper() for m, n in car_dict.items() if n < 5000]

print(list5)

# Map

# 1. Написати функцію яка повертає назву місяця за його номером. Використовуючи функцію map() і список
# який складається з чисел вивести список з навзвами місяців.
mapped_list = list(map(lambda x: calendar.month_name[x], [1, 12, 6, 8, 5]))


if __name__ == '__main__':
    print(var_lambda1("a"))
    print(var_lambda1(5, 5))

    print(var_lambda2(15, 16))

    print(var_lambda3())

    print(mapped_list)
